Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Regardless, REMOTE_USER can be used to identify the externally-authenticated user.
es: En este caso, la variable $REMOTE_USER puede ser usada para identificar al usuario autentificado externamente.

source: Configuration Note:
es: PHP usa la directiva AuthType para determinar si una autentificación externa esta en uso.

source: PHP uses the presence of an AuthType directive to determine whether external authentication is in effect.
es: Recordar no usar esta directiva cuando querais usar la autentificación de PHP (si no todo intentento de autentificación fallará)

source: Note, however, that the above does not prevent someone who controls a non-authenticated URL from stealing passwords from authenticated URLs on the same server.
es: Nota, a pesar de todo, lo ya dicho no proteje de que alguien que controle una URL no autentificada robe contraseñas de URLs autentificadas en el mismo servidor.

source: Both Netscape Navigator and Internet Explorer will clear the local browser window 's authentication cache for the realm upon receiving a server response of 401.
es: Tanto Netscape como Internet Explorer borrarán la caché de la ventana de autentificación en el navegador local después de recibir una respuesta 401 del servidor.

source: This can effectively "log out" a user, forcing them to re-enter their username and password.
es: Esto puede usarse, de forma efectiva, para "desconectar" a un usuario, forzandole a reintroducir su nombre y contraseña.

source: Some people use this to "time out" logins, or provide a "log-out "button.
es: Algunas personas usan esto para "hacer caducar" entradas, o para proveer un botón de "desconectar ".

source: Example 16-2.
es: Ejemplo 16-2.

source: HTTP Authentication example forcing a new name / password
es: Ejemplo de autentificación HTTP forzando una reentrada

source: This behavior is not required by the HTTP Basic authentication standard, so you should never depend on this.
es: Basic realm=\" Test Authentication System\""); header ("HTTP / 1.0 401 Unauthorized"); echo "You must enter a valid login ID and password to access this resource\n "; exit;} if (!isset($_SERVER['PHP_AUTH_USER']) _BAR_ _BAR_ ($SeenBefore == 1 $OldAuth == $_SER VER['$PHP_AUTH_USER']))) {authenticate();} else {echo" p Welcome: {$_SERVER['$PHP_AUTH_USER']} br "; echo "Old: {$_REQUEST['$OldAuth']}"; echo" form action='{$_SERVER['$PHP_SELF']} 'METHOD='POST' \n"; echo "input type='hidden 'name='SeenBefore' value='1 '\n"; echo" input type='hidden' name='OldAuth 'value='{$_SERVER['$PHP_AUTH_USER']}' \n"; echo "input type='submit 'value='Re Authenticate' \n"; echo" / form / p \n";}?

source: Testing with Lynx has shown that Lynx does not clear the authentication credentials with a 401 server response, so pressing back and then forward again will open the resource as long as the credential requirements haven 't changed.
es: Este comportamiento no es requerido por el estándar de autentificación básica de HTTP, por lo que nunca debe depender de esto.

source: Also note that this does not work using Microsoft 's IIS server and the CGI version of PHP due to a limitation of IIS.
es: Pruebas con Lynx han demostrado que Lynx no borra las credenciales de autentificación con una respuesta 401 del servidor, por lo que pulsando atrás y después adelante abriría el recurso de nuevo (siempre que los requerimientos de contraseña no hayan cambiado).

source: If safe mode is enabled, the uid of the script is added to the realm part of the WWW-Authenticate header.
es: Además tener en cuanta que esto no funciona usando el servidor IIS de Microsoft y la versión CGI de PHP debido a una limitación del IIS

source: Persistent connections are SQL links that do not close when the execution of your script ends.
es: Las conexiones persistentes son enlaces SQL que no se cierran cuando termina la ejecución del archivo de comandos.

source: When a persistent connection is requested, PHP checks if there' s already an identical persistent connection (that remained open from earlier) - and if it exists, it uses it.
es: Cuando se pide una conexión persistente, PHP comprueba si hay ya una conexión persistente idéntica (que permanecía abierta desde antes) - y si existe, la usa.

source: If it does not exist, it creates the link.
es: Si no existe, crea un enlace.

source: An 'identical' connection is a connection that was opened to the same host, with the same username and the same password (where applicable).
es: Una conexión 'idéntica' es una conexión que se abrió hacia el mismo "host", con el mismo nombre de usuario y la misma contraseña (donde sea aplicable).

source: There are other extensions that provide persistent connections, such as the IMAP extension.
es: Existen otras extensiones que proporcionan conexiones persistentes, tal como la extensión IMAP

source: People who aren' t thoroughly familiar with the way web servers work and distribute the load may mistake persistent connects for what they're not.
es: La gente que no está familiarizada con el modo como trabajan y distribuyen la carga los servidores "web" puede confundir que significa conexiones persistentes.

source: In particular, they do not give you an ability to open 'user sessions' on the same SQL link, they do not In particular, they do not give you an ability to open'user sessions' on the same SQL link, they do not give you an ability to build up a transaction efficiently, and they don't do a whole lot of other things.
es: En particular, no te dan la habilidad de abrir 'sesiones de usuario' en el mismo enlace SQL, no dan la habilidad de construir una transacción de forma eficiente, y no hacen un montón de otras cosas.

source: In fact, to be extremely clear about the subject, persistent connections don' t give you any functionality that wasn't possible with their non-persistent brothers.
es: De hecho, para ser extremadamente claros sobre el tema las conexiones persistentes no te dan ninguna functionalidad que no fuera posible con sus hermanas no-persistentes.

source: Why?
es: ¿Por qué?

source: This has to do with the way web servers work.
es: Esto tiene que ver con el modo como funcionan los servidores "web".

source: There are three ways in which your web server can utilize PHP to generate web pages.
es: Hay tres modos en que un servidor "web" puede utilizar PHP para generar páginas web.

source: The first method is to use PHP as a CGI "wrapper".
es: El primer método es usar PHP como una capa CGI.

source: When run this way, an instance of the PHP interpreter is created and destroyed for every page request (for a PHP page) to your web server.
es: Cuando corre de este modo, se crea y destruye una instancia del intérprete PHP por cada página solicitada (para una página PHP) a tu servidor.

source: Because it is destroyed after every request, any resources that it acquires (such as a link to an SQL database server) are closed when it is destroyed.
es: Debido a que se destruye después de cada petición, cualquier recurso que adquiera (como un enlace a un servidor de base de datos SQL) se cierra cuando es destruido.

source: In this case, you do not gain anything from trying to use persistent connections - - they simply don 't persist.
es: En este caso, no se gana nada si se intentan usar conexiones persistentes, ya que simplemente no persisten.

source: The second, and most popular, method is to run PHP as a module in a multiprocess web server, which currently only includes Apache.
es: El segundo, y más popular, método es correr PHP como un módulo en un servidor web multiproceso, lo cual actualmente sólo incluye Apache.

source: A multiprocess server typically has one process (the parent) which coordinates a set of processes (its children) who actually do the work of serving up web pages.
es: Un servidor multiproceso tiene típicamente un proceso (el padre) que coordina un conjunto de procesos (sus hijos) que realmente hacen el trabajo se servir las páginas web.

source: When each request comes in from a client, it is handed off to one of the children that is not already serving another client.
es: Cuando entra cada petición de un cliente, es entregada a uno de los hijos que no esté ya sirviendo a otro cliente.

source: This means that when the same client makes a second request to the server, it may be serviced by a different child process than the first time.
es: Esto significa que cuando el mismo cliente hace una segunda petción al servidor, puede ser atendido por un proceso hijo distinto del de la primera vez.

source: What a persistent connection does for you in this case it make it so each child process only needs to connect to your SQL server the first time that it serves a page that makes use of such a connection.
es: Lo que una conexión persistente hace por ti en este caso es hacerlo de tal modo que cada proceso hijo sólo necesita conectar a tu SQL server la primera vez que sirve una página que hace uso de una conexión así.

source: When another page then requires a connection to the SQL server, it can reuse the connection that child established earlier.
es: Cuando otra página solicita una conexión a SQL server, puede reutilizar la conexión que el hijo estableció previamente.

source: The last method is to use PHP as a plug-in for a multithreaded web server.
es: El último método es usar PHP como un "plug-in" para un servidor web multihilo.

source: Currently PHP 4 has support for ISAPI, WSAPI, and NSAPI (on Windows), which all allow PHP to be used as a plug-in on multithreaded servers like Netscape FastTrack (iPlanet), Microsoft's Internet Information Server (IIS), and O'Reilly's WebSite Pro.
es: Actualmente PHP 4 soporta ISAPI, WSAPI y NSAPI (en Windows), lo cual permite a PHP ser utilizado como "plug-in "para servidores web multihilo como Netscape FastTrack, Internet Information Server (IIS) de Microsoft, y O'Reilly 's WebSite Pro.

source: The behavior is essentially the same as for the multiprocess model described before.
es: El comportamiento es exactamente el mismo que para el modelo de multiprocesador descrito anteriormente.

source: Note that SAPI support is not available in PHP 3.
es: Tener en cuanta que el soporte para SAPI no está disponible en PHP 3.

source: If persistent connections don 't have any added functionality, what are they good for?
es: Si las conexiones persistentes no aportan ninguna funcionalidad añadida, ¿para qué son buenas?

source: The answer here is extremely simple - - efficiency.
es: La respuesta aqui es extremadamente simple - - eficiencia.

source: Persistent connections are good if the overhead to create a link to your SQL server is high.
es: Las conexiones persistentes son buenas si las cabeceras de control para crear un enlace a tu servidor SQL es alta.

source: Whether or not this overhead is really high depends on many factors.
es: Que estas cabeceras sean o no realmente altas depende de muchos factores.

source: Like, what kind of database it is, whether or not it sits on the same computer on which your web server sits, how loaded the machine the SQL server sits on is and so forth.
es: Como, qué clase de base de datos es, si esta o no situada en el mismo ordenador que el servidor web, cómo está de cargada la máquina donde se encuentre el servidor SQL, y otras así.

source: The bottom line is that if that connection overhead is high, persistent connections help you considerably.
es: El hecho fundamental es que si la cabecera de conexión es alta, las conexiones persistentes te ayudan considerablemente.

source: They cause the child process to simply connect only once for its entire lifespan, instead of every time it processes a page that requires connecting to the SQL server.
es: Ellas hacen que el proceso hijo simplemente conecte solamente una vez durante todo su intervalo de vida, en vez de cada vez que procesa una pagina que requiere conectar al servidor SQL.

source: This means that for every child that opened a persistent connection will have its own open persistent connection to the server.
es: Esto significa que por cada hijo que abrió una conexión persistente tendrá su propia conexión persistente al servidor.

source: For example, if you had 20 different child processes that ran a script that made a persistent connection to your SQL server, you 'd have 20 different connections to the SQL server, one from each child.
es: Por ejemplo, si tienes 20 procesos hijos distintos que corran un archivo de comandos que cree una conexión persistente a tu servidor SQL, tendrías 20 conexiones diferentes a ti servidor SQL, una por cada hijo.

source: Note, however, that this can have some drawbacks if you are using a database with connection limits that are exceeded by persistent child connections.
es: No obstante, hay que tener en cuenta que esto puede tener desventajas si estais utilizando una base de datos con límites de conexión, por debajo del numero de procesos hijo con conexiones persistentes.

source: If your database has a limit of 16 simultaneous connections, and in the course of a busy server session, 17 child threads attempt to connect, one will not be able to.
es: Si tu base de datos tiene un límite de 16 conexiones simultaneas y en el curso de una sesión de servidor, 17 procesos hijo intentan conectarse, uno de ellos no podrá hacerlo.

source: If there are bugs in your scripts which do not allow the connections to shut down (such as infinite loops), the database with only 16 connections may be rapidly swamped.
es: Si existen errores en los scripts, que no permitan terminar la conexion (p.ej.bucles infinitos), una base de datos con solo 32 conexiones puede ser rápidamente hundida.

source: Check your database documentation for information on handling abandoned or idle connections.
es: Comprobar la documentacion de vuestra base de datos para obtener información sobre que hacer con conexiones abandonadas ó libres.

source: There are a couple of additional caveats to keep in mind when using persistent connections.
es: Un par de advertencias más a tener en cuenta cuando utiliceis conexiones persistentes.

source: One is that when using table locking on a persistent connection, if the script for whatever reason cannot release the lock, then subsequent scripts using the same connection will block indefinitely and may require that you either restart the httpd server or the database server.
es: La primera, si utilizais bloqueos en una tabla desde una conexión persistente y por cualquier causa el script no puede desbloquear la tabla, todos los scripts posteriores que usen esta conexión, quedarán bloqueados indefinídamente y se requerirá que, ó bien el servidor httpd ó la base de datos sean arrancados de nuevo.

source: In either case, you can use register_shutdown_function() to register a simple cleanup function to unlock your tables or roll back your transactions.
es: La segunda, cuando utiliceis transacciones, un bloqueo por transacción será heredado por el próximo script usando la conexión, si la ejecución del primer script termina antes que el bloqueo. en ambos caso podeis utilizar register_shutdown_function() para registrar una funcion simple de limpieza que desbloquee las tablas ó deshaga la transacción.

source: An important summary.
es: Lo mejor para evitar problemas es no usar conexiones persistentes en scripts que usen bloqueos de tablas ó transacciones (para todolo demás pueden ser usadas sin problemas)

source: Persistent connections were designed to have one-to-one mapping to regular connections.
es: Un resumen importante.

source: That means that you should always be able to replace persistent connections with non-persistent connections, and it won 't change the way your script behaves.
es: Las conexiones persistentes fueron diseñadas para tener una equivalencia uno-a-uno con las conexiones normales.

source: See also fbsql_pconnect(), ibase_pconnect(), ifx_pconnect(), imap_popen(), ingres_pconnect(), msql_pconnect(), mssql_pconnect(), mysql_pconnect(), OCIPLogon(), odbc_pconnect(), Ora_pLogon(), pfsockopen(), pg_pconnect(), and sybase_pconnect().
es: Puede cambiar la eficiencia del archivo de comandos (y probablemete lo hará), ¡pero no su comportamiento!

source: Connection handling
es: Manejando conexiones

source: Safe Mode
es: Modo Seguro (Safe Mode)

source: In addition, URLs can be used with the include(), include_once(), require() and require_once() statements.
es: Siempre que el soporte para la "envoltura URL fopen" esté habilitado cuando se configura PHP (lo cual ocurre a menos que se pasa explícitamente la opción --disable-url-fopen-wrapper a configure (para versiones hasta la 4.0.3), ó configurar como "off "el parámetro allow_url_fopen en php.ini (para las nuevas versiones)) se pueden usar URLs HTTP y FTP con la mayoría de las funciones que toman un archivo como parámetro, incluyendo las sentencias require() e include().

source: For example, you can use this to open a file on a remote web server, parse the output for the data you want, and then use that data in a database query, or simply to output it in a style matching the rest of your website.
es: Por ejemplo, se puede usar este para abrir un archivo en un servidor web remoto, analizar en la salida la información que se quiera, y entonces, usar la información en una consulta a base de datos, o simplemente para sacarlas en un estilo que coincida con el resto de su sitio web.

source: Example 19-1.
es: Ejemplo 19-1.

source: Getting the title of a remote page
es: Obtener el título de una página remota

source: To connect as a user other than 'anonymous', you need to specify the username (and possibly password) within the URL, such as'ftp: / /user:password@ftp.example.com / path / to / file'. (You can use the same sort of syntax to access files via HTTP when they require Basic authentication.)
es: También se puede escribir a archivos en un FTP siempre que se conecte como un usuario con los correctos derechos de acceso, y el archivo no exista ya.Para conectar como un usuario distinto de 'anonymous', se necesita especificar el nombre de usuario (y posiblemente contraseña) dentro de la URL, tales como 'ftp: / /usuario:clave@ftp.ejemplo.com / camino / a/archivo'. (Se puede usar la misma clase de sintaxis para acceder a archivos via HTTP cuando se requería una autenticació de same sort of syntax to access files via HTTP when they require Basic authentication.)

source: Example 19-2.
es: Ejemplo 19-2.

source: Storing data on a remote server
es: Almacenando datos en un servidor remoto

source: You might get the idea from the example above that you can use this technique to write to a remote log file.
es: Nota:

source: To do distributed logging like that, you should take a look at syslog().
es: Podeis captar la idea en el ejemplo anterior de como escribir en un registro remoto, pero como ya hemos comentado antes, solamente se puede escribir a un fichero nuevo usando la "envoltura URL fopen" Para registros distribuidos, consultar la función syslog().

source: The PHP safe mode is an attempt to solve the shared-server security problem.
es: El Modo Seguro de PHP es un intento para resolver el problema de la seguridad en un servidor compartido.

source: It is architecturally incorrect to try to solve this problem at the PHP level, but since the alternatives at the web server and OS levels aren' t very realistic, many people, especially ISP's, use safe mode for now.
es: Tabla 22-1.

source: Table 22-1.
es: Las directivas de Configuración que controlan el Modo Seguro son:

source: Security and Safe Mode Configuration Directives
es: Valor por Omisión

source: safe_mode_include_dir
es: Cuando safe_mode está en On, el PHP verifica si el dueño del script actual coincide con el dueño del fichero a ser operado por una función de fichero.

source: NULL
es: Por ejemplo:

source: safe_mode_allowed_env_vars
es: Sin embargo, pueden haber ambientes donde una estricta verificación del UID no es apropiada, y una relajada verificación del GID es suficiente.

source: PHP_
es: Esto es soportado por medio del switch safe_mode_gid.

source: PHP_INI_SYSTEM
es: Si en vez del safe_mode, Ud. setea un directorio open_basedir, entonces todas las operaciones de fichero estarán limitadas a los ficheros bajo ese directorio especificado.

source: safe_mode_protected_env_vars
es: Por ejemplo (ejemplo de httpd.conf de Apache):

source: Here is a short explanation of the configuration directives.
es: Tabla 22-2.

source: Whether to enable PHP 's safe mode.
es: Función

source: Read the Security and chapter for more information.
es: dbmopen()

source: By default, Safe Mode does a UID compare check when opening files.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: If you want to relax this to a GID compare, then turn on safe_mode_gid.
es: Nota:

source: Whether to use UID (FALSE) or GID (TRUE) checking upon file access.
es: filepro()

source: UID / GID checks are bypassed when including files from this directory and its subdirectories (directory must also be in include_path or full path must including).
es: filepro_rowcount()

source: As of PHP 4.2.0, this directive can take a semi-colon separated path in a similar fashion to the include_path directive, rather than just a single directory.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: The restriction specified is actually a prefix, not a directory name.
es: Nota:

source: This means that "safe_mode_include_dir = / dir / incl" also allows access to "/ dir / include" and "/ dir / incls" if they exist.
es: ifx_*()

source: When you want to restrict access to only the specified directory, end with a slash.
es: ingres_*()

source: For example: "safe_mode_include_dir = / dir / incl /"
es: mysql_*()

source: If PHP is used in safe mode, system() and the other functions executing system programs refuse to start programs that are not in this directory.
es: pg_loimport()

source: Setting certain environment variables may be a potential security breach.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: This directive contains a comma-delimited list of prefixes.
es: Nota:

source: In Safe Mode, the user may only alter environment variables whose names begin with the prefixes supplied here.
es: putenv()

source: By default, users will only be able to set environment variables that begin with PHP_ (e.g.
es: Vea también la documentación de putenv()

source: PHP_FOO=BAR).
es: move_uploaded_file()

source: If this directive is empty, PHP will let the user modify ANY environment variable!
es: chdir()

source: This directive contains a comma-delimited list of environment variables that the end user won' t be able to change using putenv().
es: dl()

source: These variables will be protected even if safe_mode_allowed_env_vars is set to allow to change them.
es: backtick operator

source: Limit the files that can be opened by PHP to the specified directory-tree, including the file itself.
es: shell_exec() (equivalencia funcional de backticks)

source: This directive is NOT affected by whether Safe Mode is turned On or Off.
es: exec()

source: When a script tries to open a file with, for example, fopen or gzopen, the location of the file is checked.
es: Por razones prácticas, no está actualmente permitido tener componentes.. en la ruta del fichero ejecutable.

source: When the file is outside the specified directory-tree, PHP will refuse to open it.
es: Ud. puede correr sólo ejecutatables dentro del safe_mode_exec_dir.
